# InsertEnhancedPullDownMenuItem

## Description
Inserts the item into the specified Layout Manager enhanced pull down menu control.

```pascal
FUNCTION InsertEnhancedPullDownMenuItem(
				dialogID    : LONGINT;
				componentID : LONGINT;
				strName     : STRING;
				iIconID     : INTEGER) : INTEGER;
```

```python

def vs.InsertEnhancedPullDownMenuItem(dialogID, componentID, strName, iIconID):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|componentID|LONGINT||
|strName|STRING||
|iIconID|INTEGER||

## Version
```diff
- InsertEnhancedPullDownMenuItem is obsolete as of Vectorworks 2012
```

Availability: from VectorWorks12.5
## Category
* Dialogs - Modern